In [1]:
import numpy as np
import pandas as pd

In [3]:
# students grade
stud_grade={
    "student_id":[1,1,1,2,2,2,3,3,3,4,4,4],
    "homework_id":[1,2,3,1,2,3,1,2,3,1,2,3],
    "grade":[7,6,6,8,np.nan,np.nan,4,np.nan,6,np.nan,np.nan,np.nan]

}
allstudent_homework=pd.DataFrame(stud_grade)
allstudent_homework

# allstate_student
allstate={ 
    "student_id":[1,2,3,4],
    "student_firstname":["Marie","Joan","Marie","Hugo"],
    "student_lastname":["Butters","Reed","Maynard","Wright"]
}
allstate_student=pd.DataFrame(allstate)
allstate_student

   student_id student_firstname student_lastname
0           1             Marie          Butters
1           2              Joan             Reed
2           3             Marie          Maynard
3           4              Hugo           Wright

In [4]:
groupby_id= allstudent_homework.groupby('student_id')
groupby_id

In [5]:
avg_grade=groupby_id['grade'].mean().reset_index()
avg_grade.rename(columns={'grade':'avg_grade'},inplace=True)

In [6]:
groupby_id['grade'].count()

student_id
1    3
2    1
3    2
4    0
Name: grade, dtype: int64

In [7]:
len(allstudent_homework['homework_id'].unique())

3

In [8]:
completion_rate=(groupby_id['grade'].count()/len(allstudent_homework['homework_id'].unique())*100).reset_index()
completion_rate.rename(columns={'grade':'completion_rate'},inplace=True)

In [9]:
l1=pd.merge(allstate_student,avg_grade,on='student_id')
l1

   student_id student_firstname student_lastname  avg_grade
0           1             Marie          Butters   6.333333
1           2              Joan             Reed   8.000000
2           3             Marie          Maynard   5.000000
3           4              Hugo           Wright        NaN

In [10]:
result=pd.merge(l1,completion_rate,on='student_id')
result

   student_id student_firstname student_lastname  avg_grade  completion_rate
0           1             Marie          Butters   6.333333       100.000000
1           2              Joan             Reed   8.000000        33.333333
2           3             Marie          Maynard   5.000000        66.666667
3           4              Hugo           Wright        NaN         0.000000

In [11]:
result[['student_firstname','avg_grade','completion_rate']]

  student_firstname  avg_grade  completion_rate
0             Marie   6.333333       100.000000
1              Joan   8.000000        33.333333
2             Marie   5.000000        66.666667
3              Hugo        NaN         0.000000

In [12]:
result[['student_firstname','avg_grade','completion_rate']]

  student_firstname  avg_grade  completion_rate
0             Marie   6.333333       100.000000
1              Joan   8.000000        33.333333
2             Marie   5.000000        66.666667
3              Hugo        NaN         0.000000

In [13]:
1	2021-07-01 00:00:00	2021-09-30 00:00:00
2	2021-08-17 00:00:00	2021-09-01 00:00:00
3	2021-08-23 00:00:00	2021-09-14 00:00:00
4	2021-08-31 00:00:00	2021-09-23 00:00:00
5	2021-09-01 00:00:00	
6	2021-09-02 00:00:00	2021-09-03 00:00:00

SyntaxError: invalid syntax (<ipython-input-13-176069a1d61b>, line 1)

In [14]:
data=dict(
    user_id=[1,2,3,4,5,6],
    contract_start=["2021-07-01","2021-08-17","2021-08-23","2021-08-31","2021-09-01","2021-09-02"],
    contract_end=['2021-09-30','2021-09-01','2021-09-14','2021-09-23','2021-09-30','2021-09-03']
)
data=pd.DataFrame(data)

# convert to datetime
data['contract_start']=pd.to_datetime(data['contract_start'])
data['contract_end']=pd.to_datetime(data['contract_end'])

In [15]:
(data['contract_end']>='2021-09-1')  & (data['contract_end']<'2021-09-30')

0    False
1     True
2     True
3     True
4    False
5     True
Name: contract_end, dtype: bool

In [16]:
pd.to_datetime("2020-09-25")

Timestamp('2020-09-25 00:00:00')

In [17]:
ship={
    "shipment_id":[101,101,101,102,103,103],
    "sub_id":[1,2,3,1,1,2],
    "weight":[10,20,10,50,25,30],
    "shipment_data":["2021-08-30","2021-09-01","2021-09-05","2021-09-02","2021-09-01","2021-09-02"]
}

df = pd.DataFrame(ship)

In [18]:
df

   shipment_id  sub_id  weight shipment_data
0          101       1      10    2021-08-30
1          101       2      20    2021-09-01
2          101       3      10    2021-09-05
3          102       1      50    2021-09-02
4          103       1      25    2021-09-01
5          103       2      30    2021-09-02

In [19]:
df['year_month']=pd.to_datetime(df['shipment_data']).dt.to_period("M")

In [20]:
df.groupby('year_month').size().to_frame("num_shipment").reset_index()

  year_month  num_shipment
0    2021-08             1
1    2021-09             5

In [21]:
dec = {
    "date":['2021-01-01','2021-01-01','2021-01-06','2021-01-02','2020-12-24','2020-12-08','2020-12-09','2021-01-10','2021-01-11','2021-01-12','2021-01-15','2020-12-17','2020-12-25','2020-12-25','2020-12-25','2020-12-06','2020-12-06','2021-01-14','2021-02-07','2021-02-10','2021-02-01','2021-02-01'],
    "account_id":["A1","A1","A1","A1","A1","A1","A1","A2","A2","A2","A2","A2",'A3',"A3","A3","A3","A3","A3","A1","A1","A2","A2"],
    "user_id":["U1","U2","U3","U1","U2","U1","U1","U4","U4","U4","U5","U4","U6","U6","U6","U7","U6","U6","U1","U2","U4","U5"]
    
}

In [22]:
len(dec['user_id'])

22

In [23]:
sf_events = pd.DataFrame(dec)

In [24]:
sf_events['date']

0     2021-01-01
1     2021-01-01
2     2021-01-06
3     2021-01-02
4     2020-12-24
5     2020-12-08
6     2020-12-09
7     2021-01-10
8     2021-01-11
9     2021-01-12
10    2021-01-15
11    2020-12-17
12    2020-12-25
13    2020-12-25
14    2020-12-25
15    2020-12-06
16    2020-12-06
17    2021-01-14
18    2021-02-07
19    2021-02-10
20    2021-02-01
21    2021-02-01
Name: date, dtype: object

In [25]:
sf_events.groupby(['user_id'])['date'].shift()

0            NaN
1            NaN
2            NaN
3     2021-01-01
4     2021-01-01
5     2021-01-02
6     2020-12-08
7            NaN
8     2021-01-10
9     2021-01-11
10           NaN
11    2021-01-12
12           NaN
13    2020-12-25
14    2020-12-25
15           NaN
16    2020-12-25
17    2020-12-06
18    2020-12-09
19    2020-12-24
20    2020-12-17
21    2021-01-15
Name: date, dtype: object

In [26]:
sf=sf_events
sf.sort_values(by='date',inplace=True)

In [ ]:

id	user_id	created_at	status	type
1	100	2017-04-21 00:00:00	prequal_completd_offer	Refinance
2	100	2017-04-27 00:00:00	offer_accepted	Refinance
3	101	2017-04-22 00:00:00	prequal_completd_no_offer	Refinance
4	101	2017-04-23 00:00:00	offer_accepted	Refinance
5	101	2017-04-25 00:00:00	offer_accepted	Personal
6	102	2017-04-27 00:00:00	offer_accepted	InSchool
7	107	2017-04-27 00:00:00	prequal_response_received	Personal
8	108	2017-04-21 00:00:00	form_in_progress	Refinance
9	108	2017-04-27 00:00:00	offer_accepted	Refinance
10	108	2017-04-27 00:00:00	prequal_response_received	InSchool
11	100	2015-04-21 00:00:00	prequal_completd_offer	Refinance

In [37]:
sub={
    'id':[i for i in range(1,12)],
    'user_id':[100,100,101,101,101,102,107,108,108,108,100],
    'creatd_at':['2017-04-21','2017-04-27','2017-04-22','2017-04-23','2017-04-25'
                 ,'2017-04-27','2017-04-27','2017-04-21','2017-04-27','2017-04-27','2015-04-21'],
    'status':['prequal_completedd_offer','offer_accepted','prequal_completd_no_offer','offer_accepted','offer_accepted','offer_accepted',
             'prequal_responcse_response_received','form_in_progress','offer_accepted','prequal_response_received','prequal_completed_offer'],
    'type':['Refinance','Refinance','Refinance','Refinance','Personal',"InSchool",'Personal','Refinacne','Refinance',"InSchool",'Refincance']
}

sub_type=pd.DataFrame(sub)

In [39]:
sub_type

    id  user_id   creatd_at                               status        type
0    1      100  2017-04-21             prequal_completedd_offer   Refinance
1    2      100  2017-04-27                       offer_accepted   Refinance
2    3      101  2017-04-22            prequal_completd_no_offer   Refinance
3    4      101  2017-04-23                       offer_accepted   Refinance
4    5      101  2017-04-25                       offer_accepted    Personal
5    6      102  2017-04-27                       offer_accepted    InSchool
6    7      107  2017-04-27  prequal_responcse_response_received    Personal
7    8      108  2017-04-21                     form_in_progress   Refinacne
8    9      108  2017-04-27                       offer_accepted   Refinance
9   10      108  2017-04-27            prequal_response_received    InSchool
10  11      100  2015-04-21              prequal_completed_offer  Refincance

In [52]:
sub_type.loc[(sub_type['type']=="Refinance") | (sub_type['type']=='InSchool')].groupby('user_id')

   id  user_id   creatd_at                     status       type
0   1      100  2017-04-21   prequal_completedd_offer  Refinance
1   2      100  2017-04-27             offer_accepted  Refinance
2   3      101  2017-04-22  prequal_completd_no_offer  Refinance
3   4      101  2017-04-23             offer_accepted  Refinance
5   6      102  2017-04-27             offer_accepted   InSchool
8   9      108  2017-04-27             offer_accepted  Refinance
9  10      108  2017-04-27  prequal_response_received   InSchool

In [75]:
df=sub_type.groupby('user_id').agg({'type':'unique'}).reset_index()
df

   user_id                              type
0      100           [Refinance, Refincance]
1      101             [Refinance, Personal]
2      102                        [InSchool]
3      107                        [Personal]
4      108  [Refinacne, Refinance, InSchool]

In [76]:
df['tag']=df['type'].apply(lambda x:  1 if ('Refinance' in x) & ('InSchool' in x) else 0)

In [77]:
df

   user_id                              type  tag
0      100           [Refinance, Refincance]    0
1      101             [Refinance, Personal]    0
2      102                        [InSchool]    0
3      107                        [Personal]    0
4      108  [Refinacne, Refinance, InSchool]    1

In [79]:
df[df['tag']==1]['user_id']

4    108
Name: user_id, dtype: int64